Revit 2024 API
AnalysisDisplayStyle.SetColoredSurfaceSettings Method
 Set colored surface settings object for the style.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public void SetColoredSurfaceSettings(
	AnalysisDisplayColoredSurfaceSettings coloredSurfaceSettings
)
Visual Basic
Public Sub SetColoredSurfaceSettings ( _
	coloredSurfaceSettings As AnalysisDisplayColoredSurfaceSettings _
)
Visual C++
public:
void SetColoredSurfaceSettings(
	AnalysisDisplayColoredSurfaceSettings^ coloredSurfaceSettings
)
Parameters
coloredSurfaceSettings
Type: Autodesk.Revit.DB.Analysis.AnalysisDisplayColoredSurfaceSettings
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  colored surface settings were not created with the object.
See Also
AnalysisDisplayStyle Class
Autodesk.Revit.DB.Analysis Namespace